app/controllers/registrations_controller.rb

  def create
    build_resource(sign_up_params)
    resource.class.transaction do
      resource.save
      yield resource if block_given?
      if resource.persisted?
        @payment = Payment.new({email: params["user"]["email"],
                                token: params[:payment]["token"],
                                user_id: resource.id})
        flash[:error] = "Please check registration errors" unless @payment.valid?

        begin
          @payment.process_payment
          @payment.save
        rescue Exception => e
          flash[:error] = e.message
          resource.destroy
---
INSERT INTO "payments" ("email", "token", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "abc@example.com"], ["token", "tok_1FbaVzKcq08y3n4bo3MsDjDd"], ["user_id", 22], ["created_at", "2019-11-05 22:28:48.631670"], ["updated_at", "2019-11-05 22:28:48.631670"]]
INSERT INTO "users" ("email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]